I am unable to reproduce the issue. Running `apply` shows an error with a description of the fields that are required. What version of the provider are you using?

```
OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # hcloud_floating_ip.main will be created
  + resource "hcloud_floating_ip" "main" {
      + delete_protection = false
      + home_location     = (known after apply)
      + id                = (known after apply)
      + ip_address        = (known after apply)
      + ip_network        = (known after apply)
      + labels            = {
          + "test" = "test"
        }
      + name              = (known after apply)
      + server_id         = (known after apply)
      + type              = "ipv4"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  OpenTofu will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

hcloud_floating_ip.main: Creating...
╷
│ Error: one of home location or server is required
│ 
│   with hcloud_floating_ip.main,
│   on 977.tf line 1, in resource "hcloud_floating_ip" "main":
│    1: resource "hcloud_floating_ip" "main" {
│ 
╵
```

The docs state:

> - [`server_id`](https://registry.terraform.io/providers/hetznercloud/hcloud/latest/docs/resources/floating_ip#server_id) - (Optional, int) Server to assign the Floating IP to.
> - [`home_location`](https://registry.terraform.io/providers/hetznercloud/hcloud/latest/docs/resources/floating_ip#home_location) - (Optional, string) Name of home location (routing is optimized for that location). Optional if server_id argument is passed.

So `home_location` is only optional if `server_id` is set, which it is not in your example. I will update the docs to also have a hint on the `server_id` that it is only optional if `home_location` is set.
